InformationRegisters/ТелеграмКонтекстСеансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмКонтекстСеансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТелеграмПараметрыКонтекста</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЧата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмПараметрыКонтекста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТелеграмДействияСКонтекстом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТелеграмДействияСКонтекстом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчиститьЗначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ТелеграмКонтекстСеансов/Ext/ManagerModule.bsl
Процедура ОчиститьКонтекстСеанса(Бот, ИдентификаторЧата) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТелеграмКонтекстСеансов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Бот.Установить(Бот);
	НаборЗаписей.Отбор.ИдентификаторЧата.Установить(ИдентификаторЧата);
	НаборЗаписей.Записать();
	
КонецПроцедуры


Процедура ИзменитьПараметрКонтекстаСеанса(Бот, ИдентификаторЧата, Параметр, Действие, Значение) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТелеграмКонтекстСеансов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Бот.Установить(Бот);
	НаборЗаписей.Отбор.ИдентификаторЧата.Установить(ИдентификаторЧата);
	НаборЗаписей.Отбор.Параметр.Установить(Параметр);
	Если Действие = Перечисления.ТелеграмДействияСКонтекстом.Установить Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Бот = Бот;
		НоваяЗапись.ИдентификаторЧата = ИдентификаторЧата;
		НоваяЗапись.Параметр = Параметр;
		НоваяЗапись.Значение = Значение;
	ИначеЕсли Действие = Перечисления.ТелеграмДействияСКонтекстом.ОчиститьЗначение Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;
	НаборЗаписей.Записать();
	
КонецПроцедуры


Функция ПолучитьКонтекстСеанса(Бот, ИдентификаторЧата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмКонтекстСеансов.Параметр КАК Параметр,
	|	ТелеграмКонтекстСеансов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ТелеграмКонтекстСеансов КАК ТелеграмКонтекстСеансов
	|ГДЕ
	|	ТелеграмКонтекстСеансов.Бот = &Бот
	|	И ТелеграмКонтекстСеансов.ИдентификаторЧата = &ИдентификаторЧата";
	ТаблицаКонтекста = Запрос.Выполнить().Выгрузить();
	Возврат ТелеграмСервер.ПреобразоватьТаблицуКонтекстаВСоответствие(ТаблицаКонтекста);
	
КонецФункции


Функция ПолучитьЗначение(Бот, ИдентификаторЧата, ИмяПараметра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Запрос.УстановитьПараметр("ИмяПараметра", ИмяПараметра);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмКонтекстСеансов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ТелеграмКонтекстСеансов КАК ТелеграмКонтекстСеансов
	|ГДЕ
	|	ТелеграмКонтекстСеансов.Бот = &Бот
	|	И ТелеграмКонтекстСеансов.ИдентификаторЧата = &ИдентификаторЧата
	|	И ТелеграмКонтекстСеансов.Параметр.Наименование = &ИмяПараметра";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Значение;
	КонецЕсли;
	
КонецФункции


Функция УстановитьЗначение(Бот, ИдентификаторЧата, ИмяПараметра, Значение) Экспорт
	
	Параметр = ПланыВидовХарактеристик.ТелеграмПараметрыКонтекста.НайтиПоНаименованию(ИмяПараметра, Истина);
	Если Параметр = ПланыВидовХарактеристик.ТелеграмПараметрыКонтекста.ПустаяСсылка() Тогда
		ТекстИсключения = СтрШаблон("При установке контекста сеанса не удалось найти параметр контекста %1", ИмяПараметра);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмКонтекстСеансов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.ИдентификаторЧата = ИдентификаторЧата;
	МенеджерЗаписи.Параметр = Параметр;
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать();
	
КонецФункции
